#   每个循环核构成一层循环计算层,循环计算层的层数是向输出方向增长
#   一个循环核：一层循环计算层
#   y_{t}
#
#     ↑  w_{hy}
#
#   h_{t}         →  w_{hh}
#
#     ↑  w_{xh}
#
#   x_{t}


#   两个循环核：纵向连接,两层循环计算层
#   y_{t}
#
#     ↑  w_{hy}
#
#   h_{t}         →  w_{hh2}
#
#     ↑  w_{xh2}
#
#   h_{t}         →  w_{hh1}
#
#     ↑  w_{xh1}
#
#   x_{t}

#   三个循环核：纵向连接,三层循环计算层
#   y_{t}
#
#     ↑  w_{hy}
#
#   h_{t}         →  w_{hh3}
#
#     ↑  w_{xh3}
#
#   h_{t}         →  w_{hh2}
#
#     ↑  w_{xh2}
#
#   h_{t}         →  w_{hh1}
#
#     ↑  w_{xh21}
#   x_{t}

#   每一个循环核中的记忆体个数是根据需求任意指定的
