#   循环网络计算过程：
#   字母预测：输入a预测出b,输入b预测出c,输入c预测出d,输入d预测出e,输入e预测出a
#   神经网络的预测都是数字,所以要先把用到的a、b、c、d、e这五个字母用数字表示出来。
#   最简单直接的方法用独热码对五个字母进行编码,如下所示：
#   a:10000  b:01000 c:00100 d:00010 e:00001
#   随机生成了：
#   w_{xh} = [[0.5 -1.7 1.7]
#             [-2.3 0.8 1.1]
#             [1.3 1.7 1.4]
#             [0.3 0.8 -1.1]
#             [-1.8 -2.0 -1.0]]

#   w_{hh} = [[-0.9 -0.2 -0.4]
#             [-0.3 0.9 0.2]
#             [0.4 0.3 -0.9]]

#   w_{hy} = [[-1.7 0.7 -1.7 1.7 0.7]
#             [-1.6 -1.6 0.7 1.3 1.4]
#             [-1.4 1.9 1.2 1.7 -1.9]]
#   h_{t} = [0.0 0.0 0.0]  记忆体个数为3
#   bh = [0.5 0.3 -0.2]
#   by = [0.0 0.1 0.4 -0.7 0.1]
#   h_{t} = tanh(x_{t} * w_{xh} + h_{t-1} * w_{hh} + bh)

#   当前输入x_{t} = [0 1 0 0 0],则有
#   h_{t} = tanh([-2.3 0.8 1.1]  + [0.0 0.0 0.0] + [0.5 0.3 -0.2])
#         = tanh([-1.8 1.1 0.9]) = [-0.9 0.8 0.7]
#   这个过程可以理解为脑中的记忆因为当前输入的事物而进行了更新
#   输出y_{t}是把提取到的时间信息通过全连接进行识别预测的过程,是整个网络的输出层
#   y_{t} = softmax(h_{t} * w_{hy} + by)
#         = softmax([-0.7 -0.6 2.9 0.7 -0.8] +[0.0 0.1 0.1 -0.7 0.1])
#         = softmax([-0.7 -0.5 3.3 0.0 -0.7])
#         = [0.02 0.02 0.91 0.03 0.02]



